     **Free

        Dcl Pr NewCstmReg
        End-Pr;

        Dcl-Pr Login LikeDs(ErMsg);
         P_Loginid char(6);
         P_LoginPass char(10);
        End-Pr;

        Dcl-Pr AdminDb;
        End-Pr;

        Dcl-Pr VndrDb;
        End-Pr;

        Dcl-Pr CstDb;
        End-Pr;


